package com.gp.hmb;

import androidx.appcompat.app.AppCompatActivity;
import androidx.databinding.DataBindingUtil;

import android.os.Bundle;

import com.gp.hmb.databinding.ActivityChildGrowthBinding;

public class ChildGrowthActivity extends AppCompatActivity {
    ActivityChildGrowthBinding binding;

    String[] data = {"الشهر الأول\n" +
            "تطور نمو الطفل\n\n" +
            "التطور الحركي\n\n" +
            "• النوم على البطن هو أساس التطور الحركي لدى الرضيع، ولذلك نسعى لنرى استلقاء مريحا على البطن منذ أيام الطفل الأولى. أثناء استلقاء الطفل على بطنه ينبغي أن يحرك رأسه من جانب إلى آخر. إذا كان الطفل لا يحصل على الدعم المناسب، فان رأسه يهبط نحو الخلف.\n" +
            "• عند نوم الطفل على بطنه يمكنه التحرك بضعة سنتيمترات بواسطة حركات الأطراف الانعكاسية، وأحيانا يمكنكم أن تجدوه عند استيقاظه من النوم على الجانب الآخر من السرير.\n" +
            "• حركات أطراف الطفل الأولية هي حركات عشوائية وغير متناسقه. فالطفل يقرب يديه من عينيه وفمه، وتكون كفتا يديه لا تزالان مضمومتين في كثير من الأحيان ويمكنه امساك الشيء الذي يدخل في كف يده، لكنه لا يستطيع الاحتفاظ به لفترة طويلة.\n" +
            "• في نهاية الشهر الأول يستطيع الطفل رفع رأسه بضعة سنتيمترات وتحريكه من جانب إلى آخر. كما يبدأ الطفل أيضا بالتدحرج إلى الجنب من وضعية الاستلقاء على الظهر.\n" +
            "التطور المعرفي\n\n" +
            "• يستمتع الطفل بشعور اللمس والحركة، يحافظ على الاتصال البصري مع الشخص الذي يعتني به ويستجيب للمحفزات البيئية من خلال حركات الأطراف والأصوات. يحرك الطفل أطرافه بسرور كرد فعل على العناية التي يتلقاها أو عندما لا يكون راضيا عن ذلك.\n\n" +
            "• في الشهر الأول، يبقى الطفل نائما معظم ساعات اليوم، ولكنه في ساعات اليقظة يستجيب لأصوات والديه ويستمتع بالاستماع لهم.\n" +
            "• يمكن أن يبكي الطفل لجذب انتباه الأهل أو للتعبير عن عدم الراحة. • يمكن للطفل التعرف على ملامح والديه ويفضلهما على الآخرين.\n" +
            "تطوير الحواس واللغة\n\n" +
            "• يسمع الطفل وهو لا يزال في رحم أمه. بعد الولادة يمكنه تمييز الأصوات المألوفة، مثل صوت الأم. معظم الأطفال يرتاحون عند سماع صوت الأم، ولذلك يوصى بالتحدث اليهم والغناء لهم. الطفل يحاول أيضا أن يركز على من يتحدث إليه عن قرب.\n\n" +
            "• في الشهر الأول يستخدم الطفل التواصل غير اللفظي للتعبير عن نفسه. بواسطة مزيج من حركات الأطراف، تعابير الوجه المختلفة وأشكال من البكاء يستطيع الطفل نقل رسائل مختلفة.\n" +
            "• باستثناء البكاء، يستطيع الطفل أيضا أن يسمع أصواتا مختلفة ولكنه لا يزال غير قادر على لفظ الكلام. هو لا يفهم ما يقال له، ولكن يمكنه تمييز نبرة الصوت ويعرف جزءا من الرسالة التي يراد نقلها اليه.\n" +
            "• يمكن للطفل التعرف على رائحة أمه والرد بواسطة تعابير الوجه المختلفة على الطعم والروائح التي ينكشف لها. • حتى عمر شهر واحد يمكن للطفل التركيز على الأشياء التي تكون على بعد حوالي 20 سم عن وجهه. كذلك يمكنه\n" +
            "أيضا تتبع الأجسام المتحركة أمام وجهه لمسافة بضعة سنتيمترات. عموما، تبدو نظرات الطفل \"متنقلة\" وأحيانا تبدو حتى مثل الَحَول ."
            ,
            "من الشهر 1و حتى سن 3 أشهر،\n" +
                    "التطور الحركي \n\n" +
                    "• يبدأ الطفل بفتح قبضة يده للإمساك بالأشياء أو محاولة الإمساك بكفة اليد الممدودة له. • يكون الطفل قادرا على الصاق كفتي اليدين معا واللعب بهما. كذلك، يكون قادرا الآن على مص إبهامه أو أصابعه. • يستطيع الطفل تحريك ذراعيه بشكل عشوائي، ولكن بشكل أكثر نشاطا وحيوية مما يساعد أيضا على بناء عضلاته. • يستطيع الطفل الإمساك بلعبة بواسطة قبضة يده، لكنه لا يستطيع النظر إليها بينما هو يفعل ذلك. فهو لا يزال غير\n\n" +
                    "قادر على الربط بين اللعبة التي يمسكها وبين ما ينبغي أن يفعله بيديه. • من المهم أن يظهر الطفل في هذا العمر قدرة على إمالة الرأس إلى الجانبين عندما يكون مستلقيا على ظهره أو على\n" +
                    "بطنه. إمالة الرأس إلى جانب واحد قد تكون دلالة على الصعر( بالإنجليزية )torticollis :أو انفتال العنق.\n" +
                    "• حتى سن ثلاثة أشهر يكتشف الطفل يديه، وهذه سوف تستمر لتشكل بالنسبة له نوعا من أدوات اللعب لعدة شهور. فهو\n" +
                    "لا يزال لا يفهم ان يديه هي جزء منه، ولكن في غضون أسابيع قليلة سوف يدرك ذلك تدريجيا.\n" +
                    "• في سن ثلاثة أشهر، عندما يكون الطفل مستلقيا على بطنه، فانه يكون قادرا على رفع رأسه وصدره. بالإضافة إلى\n" +
                    "ذلك، فانه عندما يكون مستلقيا على ظهره أو بطنه فانه يكون قادرا على مد ساقيه والركل بهما. • في سن ثلاثة أشهر تقريبا تبدأ ردود الفعل التي كانت موجودة لديه عند الولادة بالاختفاء (ردود فعل مثل الامساك\n" +
                    "وغيره)، وتظهر لديه ردود فعل أخرى مثل التوازن. • يمكننا أن نرى رد الفعل التوازني من خلال مقاومة جسم الطفل للجاذبية; فإذا أملنا جسم الطفل قليلا فانه لا يسقط،\n" +
                    "وإنما يوازن جسمه ضد الحركة ويقاومها. تعتمد هذه القدرة أيضا على قوة عضلات الطفل التي ينبغي أن تكون متوازنة منذ بداية حياته.\n" +
                    "• قوة العضلات هي درجة توتر العضلات عندما لا تعمل. في هذه المرحلة العمرية يجري الطفل تقوية لعضلات الرقبة، الكتفين والأطراف، بشكل أساسي.\n" +
                    "التطور المعرفي\n\n" +
                    "• يبقى الطفل مستيقظا لفترات أطول ويبدي المزيد من الاهتمام ببيئته المحيطة. • الرؤية تصبح أكثر حدة، وفي سن شهر – شهرين تقريبا يبدأ الطفل بالتعرف على الشخصيات المألوفة له والابتسام\n\n" +
                    "لها.\n" +
                    "• في بعض الأحيان، يبدي الطفل مقاومه إذا تم إزعاجه، كما يكون قادرا على تحريك الأشياء ورميها عندما يفقد\n" +
                    "الاهتمام بها. • الطفل يصغي للأصوات وتصبح ردود أفعاله أكثر وضوحا، مثل فتح وإغلاق عينيه وما شابه ذلك. • يصبح الطفل قادرا على استخدام يديه بالتنسيق مع عينيه. بالإضافة إلى ذلك، يصبح قادرا على توجيه رأسه نحو\n" +
                    "مصدر الصوت.\n" +
                    "تطوير الحواس واللغة\n" +
                    "• في هذه المرحلة المبكرة ما يزال الطفل لا يفقه أية كلمة، فهو يتعلم فقط تطوير السمع والنطق. • يوقف الطفل كل شيء وينصت باهتمام عند الحديث بالقرب منه. • يدير الطفل رأسه نحو مصدر الأصوات، ويبدأ بالنظر الى الوجه عندما يتحدثون ويبتسمون إليه. • لا يزال الطفل يخشى كثيرا الأصوات القوية والمرتفعة جدا. • منذ سن ثلاثة أشهر أو نحو ذلك، يبدأ الطفل بالقرقرة. • مع تطوره تظهر مجموعة متنوعة أكثر من الأصوات. في هذه المرحلة يمكنكم التمييز بين صوت الناتج عن\n" +
                    "الاستمتاع أو الضيق."
            ,
            "من 3-6 أشهر تطور نمو الطفل\n" +
                    "التطور الحركي\n\n" +
                    "• في سن أربعة أشهر تقريبا يبدأ الطفل بالتدحرج، وفي سن ستة أشهر يفعل ذلك بسهولة. عندما يكون الطفل مستلقيا￼￼ على بطنه فانه يحاول ترك يد واحده لكي يمدها باتجاه شيء ما، ويتكئ على اليد الموجودة على الأرض.\n\n" +
                    "• بالإضافة إلى ذلك، في سن أربعة أشهر يمكن ملاحظة العلامات الأولى التي تشير الى بداية الزحف. يحاول الطفل أن يسحب نفسه إلى الأمام بواسطة يديه. وهو قد يتمايل حتى من جانب إلى آخر.\n" +
                    "• الطفل يمكنه أن يتدحرج، أن يدفع نفسه بواسطة يديه لمراقبة ما يهمه. ويكون قادرا، أيضا، على الاستدارة برأسه￼ وجسمه لكي ينظر إلى ما يجري حوله.\n" +
                    "• رفع الرأس عادة ما يبدأ بعد أن يكون الطفل قادرا على النوم بشكل مريح على البطن، وهذا من المفروض أن يصل إلى ذروته في سن أربعة أشهر تقريبا.\n" +
                    "• يمكن للطفل امساك الالعاب وتتبعها بعينيه عندما ينقلها من يد الى أخرى. • يكون الطفل أيضا قادرا على تتبع الالعاب عندما تسقط من يديه، ولكنه مع ذلك ينساها إذا سقطت خارج مجال رؤيته. • عندما يعطى الطفل الدعم الكامل فانه يكون قادرا على الجلوس. • عندما يكون الطفل مستلقيا على بطنه فانه يستطيع رفع قدميه الى أعلى.\n" +
                    "التطور المعرفي￼￼\n\n" +
                    "تطوير الحواس واللغة\n\n" +
                    "• يتعلم الطفل تمييز الناس القريبين منه وفقا لمدى وجودهم في حياته، وهو يفرق بين \"الأقرباء\" و\"الغرباء.\"￼ • لا يكون الطفل سعيدا جدا من بقائه مستلقيا عندما يكون مستيقظا، ويفضل وضعه على كرسي الطفل ليتمكن من\n\n" +
                    "التعرف على محيطه. • يكتشف الطفل قانون \"السبب والنتيجة\". على سبيل المثال، إذا ضرب اللعبة، فان اللعبة تتحرك. • ينظر الطفل اليكم عندما تتحدثون معه ويحاول تقليد تعابير الوجه التي يراها. • يبدي الطفل اهتماما بأكف قدميه ويديه ويلعب بها كثيرا.\n" +
                    "• يفهم الطفل كيفية استخدام اللغة للتعبير عن نفسه.￼￼\n" +
                    "• يدخل الطفل كل شيء الى فمه، يفحص الأشياء المختلفة عن طريق وضعها في الفم. هذه العملية تساعده أيضا على تطوير العلاقة بين اليد - الفم.\n" +
                    "• يكون الطفل قادرا على التوجه نحو الأصوات التي يسمعها ومتابعتها. • يبدأ الطفل بتطوير القدرة على المحادثة: \"يتحدث\" ويستمع بدوره. • في البداية، يصدر الطفل أصواتا مثل \"أهه\" و\" أوو\"، ثم يبدأ بإصدار أصوات الحروف ب، م ، ق و ف. خلال\n" +
                    "المحادثة. • الآن يقول الطفل الحروف الساكنة والمتحركة معا، مقاطع كلمات (مثل \"ما\"). في البداية، يميل إلى قول مقاطع فردية\n" +
                    "لكنه يبدأ تدريجيا بتكرار المقاطع (مثل \"ما ما\"). • حتى سن ستة أشهر ينجح الطفل في إصدار أصوات مثل \"جه\"، \"ده\"، \"مه\"، ثم يستطيع في وقت لاحق أن يجمع\n" +
                    "بينها في جملة واحدة \"جه ده مه.\"\n" +
                    "• هو يفعل ذلك خاصة عندما يتحدث شخص ما إليه أو يبتسم له. • في بعض الأحيان \"يتدرب\" الأطفال على الكلام حتى عندما يكونون وحدهم، لمجرد المتعة. • الرؤية عن بعد تتحسن، وكذلك أيضا تركيز النظر. بالإضافة إلى ذلك، يستطيع الطفل رؤية الألوان جميعا."
            ,
            "من 6-9 أشهر تطور نمو الطفل التطور الحركي\n" +
                    "• يكون الطفل قادرا على الزحف على بطنه والزحف على القوائم. بعض الأطفال لا يزالون لا يعرفون حتى الآن￼￼￼ الزحف، وانما يفضلون تخطي طريقهم على الأرض بطريقة تشبه الزحف. الزحف يقوي عضلات أشرطة الكتف لدى الطفل.\n\n" +
                    "• ينجح الطفل في الجلوس في البداية بمساعدة الدعم، وبعد ذلك دون أي دعم. بالإضافة إلى ذلك، يكون قادرا على الانتقال من وضعية جلوس الى أخرى وملاءمتها وفقا لاحتياجاته.\n" +
                    "• طريقة إمساك الطفل بالأشياء تتحسن كثيرا. يكون الطفل قادرا على مد يده للامساك بالألعاب الصغيرة، نقلها من يد إلى أخرى، يرخي اليد الأولى، يمسك بقوة باليد الأخرى ويتفحصها باهتمام بالغ.\n" +
                    "• يستطيع الطفل ادخال أصابعه في الأشياء واستخدامها. ويمكنه أيضا الإمساك بالأشياء بشكل ملقط - مسك الإصبع والإبهام ورفع الأشياء الصغيرة.\n" +
                    "• يستطيع الطفل وضع اللعبة على سطح، مثل الأرض أو اليد، ولكنه لا يزال غير مستعد لإعطائكم اللعبة بشكل عفوي. • يمكن للطفل أن يتدحرج بسهولة من البطن إلى الظهر، ومن الظهر الى البطن." +
                    "• حتى سن تسعة أشهر، يبدأ الطفل بالارتفاع إلى وضعية الوقوف بمساعدة يديه لتلقي الدعم من الأشياء التي حوله. بمجرد أن يقف الطفل للمرة الأولى، فانه سوف يقع خلال وقت قصير.\n" +
                    "• ينجح الطفل في العثور على بعض الأشياء المخبأة. كما يحاول أيضا الوصول إلى الأشياء التي يريدها.\n" +
                    "التطور المعرفي￼￼\n\n" +
                    "• هذا الجيل يتميز بوتيرة التطور السريعة، من حيث بنية الدماغ والتعلم.￼ • الطفل يستطيع أن يشغل نفسه لمدة أطول. • يتعلم الطفل ما هو \"التنظيم الذاتي\". أي: هو يبكي بسبب عدم الراحة، التعب، الجوع أو الألم، وهو يستطيع أن يتعلم\n\n" +
                    "تهدئة نفسه بدلا من انتظار المعونة من شخص بالغ.\n" +
                    "• يبدي الطفل تعابير فرح واضحه تجاه الأقرباء - الوالدين، الأخوة، أبناء الأسرة – وكذلك تعابير الخوف والقلق من\n" +
                    "الغرباء، وذلك بواسطة البكاء عند اقتراب الشخص الغريب.\n" +
                    "• مثل البالغين، يتعلم الطفل التمييز بين الأشياء التي يراها مرارا وتكرارا وتصبح معروفة لديه، وبين الأشياء الجديدة بالنسبة له.\n" +
                    "• عندما يحاول الطفل تمييز شيء يمكنكم ان تلاحظوا انه مركز، بعد ذلك يبتسم، أي، يعرب عن سعادته وسروره من مقدرته على التمييز.\n" +
                    "• يبدأ الطفل بتطوير الإدراك المكاني. على سبيل المثال، الزحف نحو اللعبة، مد يده، الامساك بها واللعب بها.\n" +
                    "تطوير الحواس واللغة￼￼\n\n" +
                    "• يستمر الطفل بإصدار الأصوات حتى عندما يكون لوحده، وكذلك بحضور الناس. كما يصدر مقاطع كلمات، وتلك بمثابة محاولة لبدء الكلام.\n\n" +
                    "• يكون الطفل قادرا على التحدث بصوت عال حتى يسمعوه. ومن ناحية أخرى، يمكنه أيضا البدء بالغناء بضع نغمات من أغنية للأطفال يعرفها.\n" +
                    "• هو يشاهد ويصغي إلى محادثات الكبار من حوله، حتى لو كانوا لا يتحدثون إليه. • في هذه الفترة يمد الطفل يديه إلى الأغراض، يسعى إلى أخذها بيديه، ويستكشفها بنفسه من خلال جسمه وحواسه،\n" +
                    "بينما يتم الجزء الأكبر من الفحص لديه من خلال حواس اللمس، السمع والذوق. • يستطيع الطفل الجمع بين المقاطع بصيغ طويلة أكثر. كما يبدأ أيضا بتغيير وتيرة ونبرة صوته، تماما كما يفعل الكبار،\n" +
                    "عند طرح السؤال مثلا. • في هذا العمر يمكن ملاحظة أن الطفل يميز اسمه وفي نهاية هذه الفترة يبدأ أيضا بتمييز الأسماء المعروفة له (مثل\n" +
                    "الأم، الأب، الضوء). في هذه السن، يفهم الأطفال كلمة \"لا\" عندما تقال بالنبرة المناسبة."
            ,
            "9-12شهرا تطور نمو الطفل\n" +
                    "التطور الحركي\n\n" +
                    "• في هذه المرحلة يكون الطفل قادرا على التحرك بقواه الذاتية بواسطة الزحف على البطن، الزحف على أربع أو ست￼￼ قوائم. قد يقترب كثيرا من الأشياء ويستخدم الأثاث لكي ينجح في التحرك من مكان الى آخر.\n\n" +
                    "• يكون الطفل قادرا على التقاط ووضع الألعاب بحسب رغبته، وذلك لأنه يستطيع التحكم بأصابعه بشكل أفضل. كما انه يفعل ذلك بطرق مختلفة: يضرب، يهز، يخض، يرمي وغير ذلك.\n" +
                    "• يستطيع الطفل التحكم بيديه بشكل رائع وحتى انه يمكنه أن يساعد في إطعام نفسه باستخدام أصابعه. كما يكون قادرا على التصفيق.\n" +
                    "• يرغب الطفل، أثناء زحفه، باستكشاف كل مكان وكل شيء من حوله. • يمكن للطفل الوقوف على قدميه لفترة قصيرة دون تلقي أية مساعدة. • ربما يكون الطفل قادرا على المشي لبضع خطوات دون مساعدة، وأحيانا حتى دون دعم.التطور المعرفي￼\n" +
                    "• هو يفهم أنه يفتقدكم عند مغادرتكم الغرفة ويرد بالبكاء.￼ • الطفل قد يكون خجولا في حضور أناس غرباء ممن لا يراهم كثيرا. • الآن يبدأ الطفل بتمييز الأشياء أكثر من الحياة اليومية، مثل أعضاء الجسم والحيوانات من الألعاب المعروفة لديه. • يستطيع الطفل التعرف على أصوات الحيوانات وحتى تقليدها. • يكون الطفل قادرا على التلويح بيديه عندما يتركه الأشخاص الذين يعرفهم. • يبدأ الطفل بتنفيذ تعليمات أوليه مثل \"أعطني قبلة\"، \"أين بابا\"، وما شابه ذلك. هذا الفهم لا يزال يستند بالأساس الى\n" +
                    "معرفة الوضع ونغمة الحديث ولذلك يحتاج طفلكم إلى الكثير من التكرار. • قد يفضل الطفل أشياء معينة. على سبيل المثال، قد يفضل دمية على أخرى. • ينجح الطفل في ادخال شيء صغير في داخل شيء أكبر.\n" +
                    "تطوير الحواس واللغة￼\n\n" +
                    "• السمع: يستمر الطفل في ادارة رأسه نحو المتكلم، كما يستمتع بتشغيل الألعاب التي تصدر الأصوات والإصغاء إليها حتى عندما تكون الأصوات ضعيفة نسبيا.\n\n" +
                    "• يستمر الطفل في الاصغاء إليكم ويتمتع بسماع صوتكم. • يستطيع الطفل التلويح بيديه ليقول وداعا، يشير بإصبعه ويبدي موافقته عن طريق تحريك رأسه. • أصبح الطفل يدرك معنى كلمة 'لا. ' • تعابير الطفل تصبح مشابهة للكلمات أكثر فأكثر. تركيبات المقاطع تصبح أكثر فأكثر تنوعا. • تطوير اللغة والسمع: في هذا العمر، يستمتع الطفل بالأنشطة المشتركة، فهو يتمتع بإعادة القيام بالتعليمات البسيطة\n" +
                    "مثل \"أين أنفك\"، \"صفق بيديك\" أو عند النظر في الكتاب \"أين البقرة.\"\n" +
                    "• يستخدم الطفل الأصوات والحركات التي اكتسبها بهدف نقل رسالة( على سبيل المثال، يشير إلى شيء ويقول)' E' ،\n" +
                    "فمن المهم الرد على طلبه. • قبل عيد ميلاده الأول على ما يبدو يكون الطفل قد أصبح يعرف اسمه ويرد عند ذكر اسمه. في نفس الفترة تقريبا،\n" +
                    "يتعلم أيضا كيف ينادي على والديه، أو يقول كلمات مثل \"بابا\"، \"ماما \"، \"دادا\" وما شابه ذلك."
            ,
            "• 12-18شهرا تطور نمو الطفل\n" +
                    "التطور الحركي\n\n" +
                    "• هناك أطفال يستطيعون المشي منذ سن تسعة أشهر بينما يتمكن آخرون من المشي فقط في سن سنة ونصف، وهذا￼￼ الموضوع يشغل بال الكثير من الأهالي. من المهم أن نتذكر أن لكل طفل وتيرة تطور مختلفة.\n\n" +
                    "• في هذه السن، يستطيع الطفل التقدم بشكل كبير من الحركة العشوائية الى الحركة الدقيقة أكثر.\n" +
                    "• يكون الطفل قادرا على التحرك وإمساك الأشياء بيديه في نفس الوقت.￼￼ • يكون الطفل قادرا على الإمساك بلعبة صغيرة في كل يد في نفس الوقت. كما يمكنه أن يمسك قلم رصاص في يده\n" +
                    "ويخربش على الورق. • يكون الطفل قادرا على الانحناء بسهولة، لرفع لعبة عن الأرض مثلا. • يصبح الطفل قادرا على الجلوس لمدة طويلة على قدميه. • يستطيع الطفل تناول الطعام الصلب لأن أسنانه تكون قد تطورت وبرزت.\n" +
                    "التطور المعرفي￼\n\n" +
                    "• يبدي الطفل رغبة كبيرة جدا في استكشاف كل شيء. كما يصبح قادرا على الاشارة باتجاه الأشياء التي يحبها.￼ • يتفاعل الطفل مع الآخرين، يبتسم، يقوم بالتواصل البصري مع الآخرين وييستطيع التعبير عن رغباته بدرجات\n\n" +
                    "متفاوتة.\n" +
                    "• يقوم بإسقاط أو رمي الالعاب الى أسفل عن قصد، ليرى أين ستذهب أو لكي يقوم الأهل بإعادتها له، فهذه هي لعبة\n" +
                    "رائعة بالنسبة له. • يكون الطفل قادرا على تحديد المكان الذي تصل اليه اللعب التي يرميها، حتى لو كانت خارج مجال رؤيته.• قد يبدي الطفل تفضيلا لجهة معينة، ولكنه يستخدم كلتيهما بالطبع. • يستمتع الطفل بتفحص طعامه، لذلك لا ينبغي أن تندهشوا اذا أصبح انتقائيا في أكله. • إذا قمتم ببناء برج صغير من قطعتين، فانه يمكنه أن يقلد هذه العملية ويقوم هو أيضا ببناء برج مماثل. كما انه يكون\n" +
                    "قادرا على وضع مكعب فوق آخر. • يستمتع الطفل عندما يغطي نفسه، بالكرسي وغير ذلك، تماما كما يحاول إطعام نفسه بالملعقة أو باليدين. • يكون الطفل قادرا على الإشارة إلى أعضاء جسمه عندما تس ّمونها بصوت عال.\n" +
                    "تطوير الحواس واللغة￼￼\n\n" +
                    "• في سن سنة واحدة ينطق الكلمات الأولى. وحتى نهاية هذه الفترة يزداد مخزون الكلمات لدى الطفل تدريجيا. الاختلافات بين الأطفال في هذا العمر تكون كبيرة جدا، لذلك لا ينبغي القلق إذا بدأ الطفل بلفظ الكلمات الأولى بعد بضعة أشهر فقط من سن سنة واحدة.\n\n" +
                    "• يستطيع الطفل استخدام عدد من الكلمات يتراوح عادة بين 6 - 10 كلمات. على سبيل المثال: بابا، ماما، تاتا وغير￼￼ ذلك. وهو يفهم بالطبع عددا أكبر من الكلمات، لكنه لا يزال لا يعرف كيفية نطقها.\n" +
                    "• معظم الكلمات التي يقولها الطفل في هذه المرحلة هي الأسماء. فهو يستخدم الكلمات بالأساس لوصف الأشياء التي تثيره. على سبيل المثال: كلب، كرة.\n" +
                    "• نطق الكلمات لا يكون واضحا تماما، وأحيانا يكون الأهل وحدهم فقط هم من يفهم ذلك. في هذه السن، يلفظ الطفل جزءا كبيرا من الكلمات بشكل جزئي فقط، على سبيل المثال \"ليب\" بدلا من حليب، أو \"وء\" بدلا من ضوء, الخ.\n" +
                    "• من حيث الفهم فإن طفلكم يفهم الآن الكثير من الكلمات، بما في ذلك الأفعال. وهو يستطيع فهم الجمل القصيرة والتعليمات البسيطة، مثل \"أعطني الكرة.\"\n" +
                    "• يسمع الطفل الأصوات المختلفة ويستجيب لها، يميز مصدر الصوت، يفحص الأصوات الجديدة ويهتم بها. قدراته السمعية أصبحت الآن مماثلة لقدراتكم أنتم، من حيث قوة الصوت الذي يستجيب له."
            ,
            "18-24شهرا معلومات\n" +
                    "التطور الحركي\n\n" +
                    "• بشكل عام، يمشي الطفل بشكل أسرع ويعمل بسرعة وتناسق.￼￼￼ • في سن 18 شهرا، ينبغي أن يركض الطفل، ولكن ليس بمرونة. في سن 24 شهرا ينبغي أن يركض بشكل جيد. • في نهاية السنة الثانية يكون لدى الطفل بين 14 - 16 سنا. في هذه الفترة يكون قادرا على أكل كل شيء. • في سن 18 شهرا يستطيع الطفل صعود الدرج عند الإمساك بيده، وفي سن 24 شهرا يكون بعض الأطفال قادرين\n\n" +
                    "على صعود الدرج ونزوله.\n" +
                    "• في سن 18 شهرا يستطيع الطفل رسم خط عمودي. وفي سن 24 شهرا يرسم خطا أفقيا ودائرة.￼ • يكثر الطفل من سحب الأشياء وراءه, وخاصة الدمى. • يكون الطفل قادرا على الوقوف على رؤوس أصابعه، ويستطيع القفز قليلا أيضا. • في سن سنتين تقريبا يستطيع الطفل امساك كوب من الماء والشرب لوحده. • في هذه السن، عادة، يبدي الطفل تفضيلا معينا لإحدى اليدين، الأمر الذي يرافقه لمدى الحياة.\n" +
                    "التطور المعرفي￼\n\n" +
                    "• في هذه السن يزداد كثيرا حب الاستطلاع لدى الطفل ويلعب لوحده في الغالب. وهو يستمتع بألعاب الخيال والتظاهر. على سبيل المثال، تمشيط دمية الدب وإطعامها.\n\n" +
                    "• يبدأ الطفل بفهم مفهوم \"الوقت\". على سبيل المثال، عندما نقول له في وقت لاحق، غدا، مباشرة بعد الغذاء وما الى ذلك.\n" +
                    "• في سن 18 - 24 شهرا يبدأ الطفل يطلب الذهاب الى المرحاض للتغوط، ويمكن تعليمه بالفعل السيطرة على ذلك. • الطفل يمكن أن يكون متمردا ويكثر من قول العبارة المفضلة: \"لا أريد.\"• يستطيع الطفل ارتداء ملابسه بنفسه، ولكنه لا يزال غير قادر على التعامل مع الأزرار أو السحابات. لتجنب إصابته بالإحباط، يجب الباسه ملابس بسيطة يمكنه خلعها بنفسه.\n" +
                    "• قد يساعدكم الطفل في مهام مختلفة، وأحيانا يحب أن يتصرف مثل الكبار، فيمكن أن يحاول كنس الأرضية أو الأشياء الملقاة عليها، وحتى استخدام المجرود.\n" +
                    "• قد يحاول الطفل تمشيط شعره أو فرك أسنانه بالفرشاة. • يستطيع الطفل تقليب صفحات الكتاب، وأحيانا يمسك عدة صفحات في آن واحد وينقلها إلى الجانب الآخر. • التنسيق بين العين واليد يصبح متطورا، فالطفل يمكنه البدء بتركيب البازل السهل، رمي أو دحرجة الكرة وهلم جرا. • حتى سن الثانية، يطور الطفل القدرة على بناء برج من 5 - 6 مكعبات. • يميز الطفل أسماء أشخاص معروفين له, وكذلك الأشياء, الحيوانات وما الى ذلك.\n" +
                    "تطوير الحواس واللغة￼￼\n\n" +
                    "• تبدأ اللغة بالتطور بسرعة. يستمتع الطفل بتعلم الكلمات الجديدة. • عادة، إذا بدأ الطفل بالكلام في سن 18 - 20 شهرا، فانه يطور لغته بسرعة. • العبارات في هذه السن تتميز بالتركيز على المحتوى وهي لا تحتوي عادة عناصر النحو والصرف. فيقول الطفل،\n\n" +
                    "مثلا: \"دمية أكل\" بدلا من \" الدمية تأكل. \" • يكون الطفل قادرا على الربط بين عدة كلمات معا، مثل \"ذهب أبي\" أو \"خلع الحذاء\". في وقت لاحق يستطيع الطفل\n" +
                    "اضافة كلمات مثل: كفى، أكثر، لا يوجد وما الى ذلك. • في سن عامين، يستطيع معظم الأطفال تكوين جملة من ثلاث كلمات - أنا ذاهب للروضة. • قد يستخدم الطفل كلمات فريدة من نوعها انتم وهو وحدكم تفهمونها. • يبدأ الطفل باستخدام اللغة كلعبة لتطوير خياله. • فهمه لا يزال يعتمد على معرفته والسياق. لذلك، حتى لو كان لا يفهم كل كلمات الجملة فانه يعتمد على الكلمات التي\n" +
                    "يعرفها. • الأطفال الذين يبقون في المنزل مع شخص واحد، يمكن أن يحصل لديهم تطور الكلام بصورة أبطأ بسبب قلة فرص\n" +
                    "التواصل. في سن سنتين يمكن أن تظهر التأتأة أحيانا. • نطق الكلمات لم يكتمل بعد ولكن يبدو تحسن تدريجي، ويتم لفظ المزيد من الكلمات بشكل كامل. • السمع: في هذه السن يتحسن التمييز السمعي تدريجيا، الأمر الذي يسهم أيضا في تحسين النطق. • يستمتع الطفل بالقصص التي تشمل خدعة بسيطة ومتكررة."
    };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        binding = DataBindingUtil.setContentView(this, R.layout.activity_child_growth);

        int position = 0;
        int days = getIntent().getIntExtra("days", 0);

        if (days <= 30) {
            position = 0;
        } else if (days <= 90) {
            position = 1;
        } else if (days <= 180) {
            position = 2;
        } else if (days <= 270) {
            position = 3;
        } else if (days <= 360) {
            position = 4;
        } else if (days <= 540) {
            position = 5;
        } else if (days <= 720) {
            position = 6;
        }

        binding.setMessage(data[position]);
    }

}