package com.gp.hmb;

import androidx.appcompat.app.AppCompatActivity;
import androidx.databinding.DataBindingUtil;

import android.os.Bundle;

import com.gp.hmb.databinding.ActivityInstructionsBinding;

public class InstructionsActivity extends AppCompatActivity {
    ActivityInstructionsBinding binding;

    String[] data = {
            "• في بداية حياته عليكم منح الطفل الكثير من الحب والدفء والتواصل. يفضل منحه سبلا مختلفة من التواصل، مثل اللمسة اللطيفة من جانب الى آخر واللمسة القوية والمهدئة من ناحية أخرى. اللمسة القوية تشير الى حدود جسم الطفل في الدماغ، تمنحه الشعور بالأمن والأمان، تعطيه صورة واضحة لجسمه وتسمح للأعضاء بأن تقوم بوظائفها الحركية. كلما كان اللمس أعمق، أصبحت العلاقة بين العضو ووظيفته أكثر كفاءة وصحيحة أكثر.\n" +
                    "• أحد الأشياء التي يمكن أن تؤثر على تطور الطفل، وكذلك على هدوئه، هي استخدام وضعية الأرجوحة – وضعية الأرجوحة تطيل عضلات الظهر وترخي عضلات البطن. هكذا يمكن المساعدة على النوم المريح على البطن، منع\n" +
                    "انتفاخ البطن وتعليم الطفل تقريب اليدين إلى خط الوسط مما يمنحه شعورا بالأمان. استخدام وضعية الأرجوحة، أو\n" +
                    "استخدام حمالة الأرجوحة، هو بداية رائعة للحياة من ناحية حركية، حسية وعاطفية.\n" +
                    "• التعرض لمحفزات مختلفة هو عامل جيد للطفل - مثل أنواع مختلفة من الألعاب، المرايا والأصوات. من المهم عدم\n" +
                    "تعريضه لتحفيز حسي زائد لأن ذلك سيسبب له عدم الهدوء. لذلك، لا ينبغي احاطة الطفل بعدد كبير جدا من ألعاب الاطفال، وبالطبع عدم وضعه أمام شاشة التلفزيون.\n" +
                    "• من المهم وضع الطفل على بطنه منذ ولادته، لأن ذلك سوف يؤثر على مجمل تطوره، إذ من هناك يبدأ تطوره الحركي. ينبغي تعريضه لأكبر عدد من وضعيات الاستلقاء المختلفة.\n" +
                    "• يجب على الطفل أن يجرب الحركة في الفراغ من أجل تطوير التوازن لديه، وهو ما سوف يؤثر في وقت لاحق على قدرة الطفل على التقلب، الزحف والمشي. يفضل أيضا البدء بوضع الطفل على جنبه ومساعدته على تقريب يديه الى خط الوسط والانقلاب البسيط من الظهر إلى البطن لاحقا.\n" +
                    "• حاسة البصر تكون أقل تطورا وغير مهمة في هذه المرحلة. يمكن وضع صور بالأبيض والأسود على مسافة قصيرة من وجهه. في هذا العمر، يكون التحفيز البصري هو الأكثر أهمية. من المهم التحدث والغناء للطفل، المحافظة على الاتصال البصري معه والتحدث معه، سوية مع ابراز تعابير الوجه بشكل مفرط. التواصل اللفظي، الغناء، ترديد القوافي واستخدام الصوت المرتفع يعطي الطفل الأمان، الهدوء والتواصل الرائع مع الوالدين والبيئة المحيطة.\n" +
                    "• من المهم امساك الطفل بشكل متناظر عند حمله لتجنب ميله إلى جانب دون الآخر. كذلك، يفضل الحفاظ على تناظر جسم وحركة الطفل بواسطة وضعه كل مرة على جانب آخر عند النوم، الإمساك به من كتف مختلفة في كل مرة،\n" +
                    "وضعه في وضعية الأرجوحة بحيث يوجه رأسه في كل مرة الى جانب آخر، اطعامه بحيث يكون رأسه في كل مرة متجها الى جانب آخر، وهلم جرا. يفضل الامساك به بحيث يكون قريبا من جسم الأم ليشعر بدفء جسمها ونبضات قلبها.\n" +
                    "• إذا قمتم بالخروج مع الطفل بالعربة فيفضل أن يكون الطفل مستلقيا تماما في العربة. يفضل أكثر الخروج مع الطفل بحيث يكون محمولا في حمالة بوضعية الأرجوحة.\n" +
                    "• في نهاية الشهر الأول يبدأ الطفل بالابتسام. ابتسامته الحاليه تكون عبارة عن استجابة فسيولوجية تشير إلى أنه را ٍض ومرتاح."
            ,
            "• حملوا الطفل ودعوه يرى الأشكال، الألوان والأضواء. كل شيء جديد يجعله ينبهر في البداية. قوموا بتعريضه للهواء والشمس مما يساعده على تطوير الحواس ويساعده على الشعور بالهدوء.\n" +
                    "• تحدثوا معه كلما كان ذلك ممكنا، وخصوصا عندما يصدر أصواتا أو ينظر نحوكم. • رددوا كل فعل يومي سيقوم به بصوت عال مثل: \"الآن أنت ستذهب للاستحمام\"، \"هذه لعبتك الزرقاء\" وما شابه ذلك. • تحدثوا إلى الطفل كما لو أنه كان يفهم كل كلمة تقولونها. • واصلوا لمسه، تقبيله معانقته واحتضانه، وإعطاءه الكثير من الاهتمام والحب. • حاولوا اصدار أصوات مماثلة للأصوات التي يصدرها طفلكم وانتظروا ردة فعله. يمكنكم الاستمرار بذلك وملاحظة\n" +
                    "ردات فعله عدة مرات. كذلك، حاولوا التحدث معه من وقت إلى آخر بصوت منخفض. • ق ّصوا عليه قصة من كتاب، ويفضل أن تكون مع صور بالأبيض والأسود. فالطفل سوف ينظر إلى الصور ويصغي\n" +
                    "إلى صوتكم باستمتاع. • اشتروا له خشخاشة: فعندما يمسك الخشخاشة في يده، سوف يسمع الضجيج ويبدأ بالربط بين حركة يده والصوت\n" +
                    "الناتج عنها. كذلك فهو يتعلم ويفهم أنه إذا كان بالإمكان سماع شيء، فمن الممكن رؤيته أيضا، على ما يبدو. • يمكنكم وضع العاب لهواتف خلوية ملونة حوله حيث يمكنه التركيز عليها ولمسها. • اسمحوا له باللعب بالدمى المرخصة وفق معايير الأمن والسلامة، والتي سوف تساعده على تنمية الشعور بإمساك\n" +
                    "الحاجيات وتساعد في تطور حواسه."
            ,
            "• تحدثوا إلى طفلكم بأكبر قدر ممكن. فكلما تحدثتم معه أكثر, كلما \"تكلم\" معكم بنفس الوتيرة. • عندما تجرون معه \"محادثة\" أعطوه الوقت للرد والتعبير عن نفسه. • غنوا له الأغاني وقصوا عليه قصص الأطفال. هكذا يعتاد على الاصغاء والاستمتاع بالإيقاع والأصوات. • حاولوا تقريبه اليكم أثناء سرد القصة، حتى يتمكن من رؤية الصور والألوان ولكي يسمعكم بوضوح، أيضا. • استمروا في حمله لأطول فترة ممكنة، إذ أنه لا يزال بحاجة إلى الكثير من اللمس والاهتمام. • وفروا له ألعابا لينة: في سن ستة أشهر تقريبا، يكون معظم الأطفال قادرين على امساك الالعاب اللينة، الصغيرة\n" +
                    "والمثيرة للاهتمام وذات الأشكال المختلفة. • تجنبوا الألعاب الصلبة أو الثقيلة. عند إحضار لعبة جديدة للطفل، يجب السماح له باللعب بها وهي موجودة في راحة\n" +
                    "يدكم أو على سطح صلب قبل أن تسمحوا له بالإمساك بها. • سوف يحاول الطفل فحص اللعبة والتعرف عليها من خلال وضعها في فمه. لذلك، يجب اختيار الالعاب التي يسهل\n" +
                    "حملها ولا توجد خطورة من إدخالها الى الفم. • مركز فعاليات: يفضل تخصيص زاوية ألعاب للطفل حيث يمكنه اللعب فيها بهدوء. يفضل أن نضع هناك، على سبيل\n" +
                    "المثال، ألعاب التصفير التي تصدر أصواتا مختلفة، لتثير وتجذب اهتمام الطفل."
            ,
            "من المهم تعزيز العلاقة الحسية بين الطفل والقائمين على رعايته. يمكن القيام بذلك بطريقتين: أولا، من خلال التعابير￼￼\n" +
                    "اللطيفة من قبل الشخص الذي يقدم الرعاية للطفل: العناق، المسح، التدليك، الابتسامة، وهلم جرا. \n" +
                    "• ثانيا، تكوين علاقة متواصلة، من خلال تحديد فعاليات ترفيهيه مشتركه خلال اليوم مع الطفل. فهو يتعلم بذلك بناء الثقة، الاعتماد، ويعرف أن الشخص الذي يرعاه يعود إليه بشكل دائم.\n" +
                    "• في الأسابيع الأولى التي ينجح فيها الطفل في الجلوس دون أي دعم، يف َضل البقاء بالقرب منه ومراقبته. • غنوا له أغاني الأطفال السهلة للاستيعاب. قد يغني من خلال لفظه لبعض اللحن. • قولوا بصوت عال أسماء الأشياء الموجودة حوله، حتى يستطيع أن يربط بين اسمها وشكلها ومظهرها. • استخدموا اسم الطفل عند التحدث معه، مثلا: \"أين قبعة رامي\"؟ ، \"رامي سيذهب الى النوم\" وما شابه ذلك. • انظروا معا بتمعن في الكتب، الصور، الرسوم، وكل محفز يحتوي على الكثير من الألوان. • يمكن وضع مصاصة بالقرب من الطفل وتعليمه أن يضعها في فمه بنفسه.\n" +
                    "• كومة من الالعاب: تستخدم هذه في تطوير قدرته على تنظيم العالم من حوله، وتطوير التناسق بين يديه وعينيه. في البداية لا يكون الطفل قادرا على ترتيب الأشياء وحده، لذلك عليكم أن تبينوا له كيفية القيام بذلك.\n" +
                    "• من المهم أن تبينوا للطفل ما الذي يمكن القيام به بواسطة الأشياء المختلفة. على سبيل المثال: قرع الجرس، ضرب مكعب بآخر، ملعقة بملعقة، الضغط على الزر في اللعبة لكي تفتح العلبة أو يصدر صوتا وما الى ذلك. هذه الأنشطة تعلم الطفل التحكم، وبذلك يعرف كيفية تشغيل الأشياء من حوله.\n" +
                    "• المرآة: الأطفال يجدون في انعكاس صورتهم في المرآة شيئا مثيرا. اختاروا المرآة الآمنة، غير القابلة للكسر بسهولة، والمناسبة بشكل خاص للأطفال.\n" +
                    "• يوصى على سبيل المثال بشراء لعبة الهاتف الخلوي للطفل، الع ّلاقة التي تحمل الدمى وتصدر أصواتا لطيفه وغير ذلك. يجب التأكد من ان اللعب التي تم اختيارها هي آمنة.\n" +
                    "• يوصى على سبيل المثال بشراء لعبة الهاتف الخلوي للطفل، الع ّلاقة التي تحمل الدمى وتصدر أصواتا لطيفه وغير￼ ذلك. يجب التأكد من ان اللعب التي تم اختيارها هي آمنة."
            ,
            "تأكدوا من أن المنزل آمن بالنسبة للطفل، لا توجد أية أسلاك كهربائية مكشوفة أو مفاتيح كهربائية غير مغطاة، مواد￼￼\n" +
                    "تبييض ومواد خطرة قريبة من متناول يدي الطفل. \n" +
                    "• حتى عندما تكونون خارج المنزل يجب عليكم فحص الأشياء التي يمسكها طفلكم. أي شيء يعجبه فانه سوف يدخله في فمه، ولذلك فمن المهم تفحص بيئته.\n" +
                    "• طفلكم يستمتع بالنظر الى لعبة الغماضة، اللعبة التي تقومون فيها بالاختباء لثانية أو اثنتين ثم تقفزون مع ابتسامة. هذه اللعبة تساعده على أن يفهم أنه حتى عندما لا يمكنه رؤيتكم، فإنكم لا تزالون موجودين. وفي وقت لاحق سوف يجرب نفس العملية عليكم.\n" +
                    "• أغاني وقصص الأطفال هي مثالية في هذه المرحلة. استخدموا الكتب التي تحتوي على صورة كبيرة لشيء واحد في كل صفحة. استخدموا اسم الشيء المبين في الكتاب: \"انظر هذه هي البطة، البطة صفراء.\"\n" +
                    "• اقرؤوا له نفس الكتب مرارا وتكرارا. فهو سوف يستمتع بالأشياء التي يعرفها وبذلك فإنه سيطور مهاراته اللغوية بشكل أفضل.\n" +
                    "• يمكن \"ترجمة\" طلبه إلى كلمات (على سبيل المثال: \"ما هذا؟ \" ) وكذلك الاجابة (على سبيل المثال: \"هذا كلب\"). اجاباتكم سوف تشجع طفلكم على استخدام اللغة لتحقيق احتياجاته.\n" +
                    "• ملاءمة الأشكال: دعوه يلعب بالألعاب التي تشجعه على ملاءمة الأشكال، مما يزيد من مهاراته. • الألعاب القابلة للضغط: دعوا الطفل يلعب بألعاب تحتوي على أزرار قابلة للضغط أو تدور والتي تصدر أصواتا\n" +
                    "مختلفة ردا على كل عملية ضغط عليها. بهذه الطريقة يتعلم الطفل أن كل شيء يؤدي إلى شيء آخر.￼\n" +
                    "• اللهو في الحمام: الآن يمكن للطفل الجلوس في الحمام دون دعم. هو يستمتع عند ملء الماء وسكبه، كما انه يحب رش الماء في كل الاتجاهات.\n" +
                    "• شجعوه على التصفيق، وضع يديه على رأسه وهلم جرا."
            ,
            "•\n" +
                    "• استخدموا لغة بسيطة لوصف مراحل النشاط. كرروا ذلك كل يوم، وبالتدريج ابدأوا الجملة وانتظروا طفلكم. بالتدريج سوف يبدأ بإكمال الجملة وحتى بالمبادرة الى ذلك، على سبيل المثال في الحمام : \"الآن سوف نضع الصابون على ... \". تجاهلوا طريقة نطق الكلمات وقوموا بتكرارها بشكل واضح وكامل. على سبيل المثال، إذا قال طفلكم \"لع\" قولوا \"هذه لعبه كبيرة.\"\n" +
                    "• عبروا عن العواطف من خلال الكلمات، لكي تعطي تأثيرا أكبر. على سبيل المثال: \"واو, انظر الى البرج الذي بنيته!\", \" اه لا، لقد تحطم برجك.\"!\n" +
                    "• انظروا الى الطفل عندما تتحدثون إليه واتركوا له الوقت الكافي للرد. بالإضافة إلى ذلك، لائموا بين الكلمات التي تقولونها وبين تعابير الوجه وإطراءاتكم.\n" +
                    "• من سن سنة واحدة يمكن الانتقال من قراءة الأغاني والجمل القصيرة للطفل إلى الأغاني المتعلقة بعالمه، بالجسم وأعضائه، الغرفة، العائلة، وما الى ذلك. الأطفال يحبون القصص عن الحيوانات.\n" +
                    "• أعطوه اللعب التي تشبه الأشياء الحقيقية. على سبيل المثال: لعبة الهاتف، طعام من البلاستيك، دمية دب له فراء وغير ذلك. فهذه سوف تشجعه على التحدث وتطوير الخيال.\n" +
                    "• بناء المكعبات: يستطيع الطفل بناء برج بنفسه، وهو يستمتع عند هدم البرج الكبير الذي قمتم ببنائه معه. هذه اللعبة جيدة للتنسيق بين العينين واليدين.\n" +
                    "• لعب العجين: الطفل يحب رق العجين. يمكنكم وضع شوبك للعجين وقطع لأشكال خاصة من شأنها توسيع نطاق خيارات اللعبة مع العجين. يستمتع الطفل عندما يراكم تحضرون أنتم أيضا أشياء من العجين.\n" +
                    "في هذه السن وبعدها سوف يستمر تطور قدرات محددة في مجال الاستماع والتمييز بين الأصوات. تعريض طفلكم￼ لمحفزات صوتيه أكثر تزيد من المخزون السمعي لديه وتمكنه من التفاعل بشكل صحيح مع الأصوات الصادرة من محيطه.\n" +
                    "• اللعب التي يمكن دفعها وجذبها معا: هذه تساعد على تحسين التوازن والتنسيق؛ عملية الدفع تعطي الطفل الثقة بالنفس وتحسن مشيته, وعملية الجذب جيدة لكي يعرف الطفل انه يمكنه المشي الى الخلف أيضا. ابحثوا عن اللعب ذات القاعدة الواسعة والمنخفضة، فإنها أقل عرضة للانقلاب.\n" +
                    "• الادوات الموسيقية: يستمتع الطفل باصدار أصوات موسيقية أو الاستماع إلى الموسيقى. الآلات الموسيقية الأولى الموصى بها هي الأدوات التي يمكن هزها أو ضربها، مثل الطبلة.\n" +
                    "• لعبة التركيب (البازل) الأولى: أعطوه \"بازل\" مكونا من عدد قليل من الأجزاء، بحيث يكون مناسبا لسن الطفل"
            ,
            " تقبلوا وردوا على الكلمات التي لا معنى لها التي يقولها الطفل، ولكن كرروا الكلمة بشكلها الصحيح عند الرد. على￼\n" +
                    "سبيل المثال، الطفل: \"لعمه\" . أنتم: \"لعبة كبيرة \" \n" +
                    "• اطرحوا أسئلة على الطفل عندما تتصفحون الكتب معا: \"هل يمكنك ان ترى الكلب؟\"، \"ماذا يوجد هنا؟\" وهلم جرا. • يمكن للأهل الذين يتحدثون ببطء وبتركيز الى طفلهم أن يسببوا له مشكلة في اللغة – لأنه قد يسمع الكلمات كعدة\n" +
                    "مقاطع. • أعطوه امكانية تنفيذ المهمات البسيطة، فهو سوف يستمتع بفهم الطلب ويشعر بأنه شخص مفيد، على سبيل المثال:\n" +
                    "\"يمكنك العثور على الفرشاة واحضارها لي؟.\" • التنزه خارج البيت يوصى به جدا، ويفضل التخطيط للرحلات مسبقا ثم التحدث عنها مع الطفل واستعادة الأحداث. • أعطوه الالعاب الحقيقية: التقليد والتمثيل يشجع المهارات اللغوية، التفكير, القدرة على التصنيف والمهارات\n" +
                    "الاجتماعية. اعطوه صيغة لعبة لإحدى الأدوات المنزلية، فالاطفال يحبون أيضا استخدام الدمى، لكن تحققوا من سلامتها قبل احضارها للطفل.\n" +
                    "• ألعاب تقمص الأدوار: الألعاب التي تسمح للطفل بأن يكون مسؤولا عن عالمه. على سبيل المثال: ادخال وإخراج الناس من الحافلة، وضع الدمى في العربة، الأطباق من البلاستيك والأكواب لإطعام دمى الدببة وهلم جرا. هذا التنظيم يسمح له بالتجربة وفهم كيف يسير العالم من حوله، فضلا عن أنه يتيح له الشعور بالسيطرة.\n" +
                    "￼\n" +
                    "• الألوان: أحضروا للطفل ألوان الشمع السميكة التي يسهل مسكها; هذه الألوان تترك علامة، ولا يهم كيف يتم مسكها. في البداية يمسك الطفل الألوان ويرسم خطوطا. يكون الطفل سعيدا بظهور العلامة على الورقة، دونما أهمية للنتيجة.\n" +
                    "• الكرات: أعطوه الكرات اللينة والكبيرة حتى يتمكن من ركلها ورميها. كرة البحر تعتبر مثالية في هذه الحالة. كما هو الحال مع أي شيء آخر، فكلما استمتع الطفل أكثر فانه يطور أيضا مهاراته بسرعة أكبر.\n" +
                    "• الملابس: ارتداء الملابس هي وسيلة ممتعة لاستكشاف كيف يمكن التحول الى شخص آخر. القبعات القديمة، الحقائب وغير ذلك تشجع اللعب لدى الطفل.\n" +
                    "• الركوب على اللعبة: منذ الآن يستطيع الطفل الجلوس منفرج الساقين على لعبة الحصان ذات الأربع عجلات، والحفاظ على توازنه ثم دفع نفسه بواسطة قدميه."
    };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        binding = DataBindingUtil.setContentView(this, R.layout.activity_instructions);

        int position = 0;
        int days = getIntent().getIntExtra("days", 0);

        if (days <= 30) {
            position = 0;
        } else if (days <= 90) {
            position = 1;
        } else if (days <= 180) {
            position = 2;
        } else if (days <= 270) {
            position = 3;
        } else if (days <= 360) {
            position = 4;
        } else if (days <= 540) {
            position = 5;
        } else if (days <= 720) {
            position = 6;
        }

        binding.setMessage(data[position]);

    }

}